app/models/message_node.rb

SELECT "message_nodes".* FROM "message_nodes" WHERE "message_nodes"."content_hash" = 'b12aab8ef639c5e7981ee6a03150853966fffb667d996ada3f6ac9a2ffcd93fe' LIMIT 1
---
  def thread_chain
    chain = [ self ]
    current = self
    while current.parent_hash.present?
      current = self.class.find_by(content_hash: current.parent_hash)